; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Planet22 - direction
	Planet23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Planet26 - direction
	Planet27 - direction
	Phenomenon28 - direction
	Phenomenon29 - direction
	Star30 - direction
	Planet31 - direction
	Phenomenon32 - direction
	Star33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Star36 - direction
	Planet37 - direction
	Planet38 - direction
	Planet39 - direction
	Phenomenon40 - direction
	Star41 - direction
	Planet42 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image1)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image1)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star21)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star41)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 spectrograph2)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet19)
)
(:goal (and
	(pointing satellite1 Phenomenon35)
	(pointing satellite2 Planet42)
	(pointing satellite3 GroundStation2)
	(have_image Phenomenon4 thermograph0)
	(have_image Star5 thermograph0)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Star9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Planet13 spectrograph2)
	(have_image Planet14 spectrograph2)
	(have_image Star15 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Phenomenon18 thermograph0)
	(have_image Planet19 spectrograph2)
	(have_image Star21 thermograph0)
	(have_image Planet22 image1)
	(have_image Planet23 spectrograph2)
	(have_image Planet24 thermograph0)
	(have_image Phenomenon25 image1)
	(have_image Planet27 thermograph0)
	(have_image Phenomenon28 thermograph0)
	(have_image Phenomenon29 image1)
	(have_image Star30 spectrograph2)
	(have_image Planet31 spectrograph2)
	(have_image Phenomenon32 thermograph0)
	(have_image Star33 image1)
	(have_image Planet34 image1)
	(have_image Phenomenon35 image1)
	(have_image Star36 spectrograph2)
	(have_image Planet37 thermograph0)
	(have_image Planet38 image1)
	(have_image Planet39 image1)
	(have_image Phenomenon40 thermograph0)
	(have_image Star41 image1)
	(have_image Planet42 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 37
2. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 0 of 37
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 37
4. (turn_to satellite0 phenomenon17 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 37
5. (take_image satellite0 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 1 of 37
6. (turn_to satellite0 phenomenon18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon18)
   goals met: 1 of 37
7. (take_image satellite0 phenomenon18 instrument1 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 2 of 37
8. (turn_to satellite0 phenomenon25 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon25)
   goals met: 2 of 37
9. (take_image satellite0 phenomenon25 instrument1 image1)
   added: (have_image phenomenon25 image1)
   goals met: 3 of 37
10. (turn_to satellite0 phenomenon28 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon28)
   goals met: 3 of 37
11. (take_image satellite0 phenomenon28 instrument1 thermograph0)
   added: (have_image phenomenon28 thermograph0)
   goals met: 4 of 37
12. (turn_to satellite0 phenomenon29 phenomenon28)
   deleted: (pointing satellite0 phenomenon28)
   added: (pointing satellite0 phenomenon29)
   goals met: 4 of 37
13. (take_image satellite0 phenomenon29 instrument1 image1)
   added: (have_image phenomenon29 image1)
   goals met: 5 of 37
14. (turn_to satellite0 phenomenon32 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon32)
   goals met: 5 of 37
15. (take_image satellite0 phenomenon32 instrument1 thermograph0)
   added: (have_image phenomenon32 thermograph0)
   goals met: 6 of 37
16. (turn_to satellite0 phenomenon35 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon35)
   goals met: 6 of 37
17. (take_image satellite0 phenomenon35 instrument1 image1)
   added: (have_image phenomenon35 image1)
   goals met: 7 of 37
18. (turn_to satellite0 phenomenon4 phenomenon35)
   deleted: (pointing satellite0 phenomenon35)
   added: (pointing satellite0 phenomenon4)
   goals met: 7 of 37
19. (take_image satellite0 phenomenon4 instrument1 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 8 of 37
20. (turn_to satellite0 phenomenon40 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon40)
   goals met: 8 of 37
21. (take_image satellite0 phenomenon40 instrument1 thermograph0)
   added: (have_image phenomenon40 thermograph0)
   goals met: 9 of 37
22. (turn_to satellite0 phenomenon6 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon6)
   goals met: 9 of 37
23. (take_image satellite0 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 10 of 37
24. (turn_to satellite0 planet13 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet13)
   goals met: 10 of 37
25. (take_image satellite0 planet13 instrument1 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 11 of 37
26. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 11 of 37
27. (take_image satellite0 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 12 of 37
28. (turn_to satellite0 planet19 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet19)
   goals met: 12 of 37
29. (take_image satellite0 planet19 instrument1 spectrograph2)
   added: (have_image planet19 spectrograph2)
   goals met: 13 of 37
30. (turn_to satellite0 planet22 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet22)
   goals met: 13 of 37
31. (take_image satellite0 planet22 instrument1 image1)
   added: (have_image planet22 image1)
   goals met: 14 of 37
32. (turn_to satellite0 planet23 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 planet23)
   goals met: 14 of 37
33. (take_image satellite0 planet23 instrument1 spectrograph2)
   added: (have_image planet23 spectrograph2)
   goals met: 15 of 37
34. (turn_to satellite0 planet24 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet24)
   goals met: 15 of 37
35. (take_image satellite0 planet24 instrument1 thermograph0)
   added: (have_image planet24 thermograph0)
   goals met: 16 of 37
36. (turn_to satellite0 planet27 planet24)
   deleted: (pointing satellite0 planet24)
   added: (pointing satellite0 planet27)
   goals met: 16 of 37
37. (take_image satellite0 planet27 instrument1 thermograph0)
   added: (have_image planet27 thermograph0)
   goals met: 17 of 37
38. (turn_to satellite0 planet31 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 planet31)
   goals met: 17 of 37
39. (take_image satellite0 planet31 instrument1 spectrograph2)
   added: (have_image planet31 spectrograph2)
   goals met: 18 of 37
40. (turn_to satellite0 planet34 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 planet34)
   goals met: 18 of 37
41. (take_image satellite0 planet34 instrument1 image1)
   added: (have_image planet34 image1)
   goals met: 19 of 37
42. (turn_to satellite0 planet37 planet34)
   deleted: (pointing satellite0 planet34)
   added: (pointing satellite0 planet37)
   goals met: 19 of 37
43. (take_image satellite0 planet37 instrument1 thermograph0)
   added: (have_image planet37 thermograph0)
   goals met: 20 of 37
44. (turn_to satellite0 planet38 planet37)
   deleted: (pointing satellite0 planet37)
   added: (pointing satellite0 planet38)
   goals met: 20 of 37
45. (take_image satellite0 planet38 instrument1 image1)
   added: (have_image planet38 image1)
   goals met: 21 of 37
46. (turn_to satellite0 planet39 planet38)
   deleted: (pointing satellite0 planet38)
   added: (pointing satellite0 planet39)
   goals met: 21 of 37
47. (take_image satellite0 planet39 instrument1 image1)
   added: (have_image planet39 image1)
   goals met: 22 of 37
48. (turn_to satellite0 planet42 planet39)
   deleted: (pointing satellite0 planet39)
   added: (pointing satellite0 planet42)
   goals met: 22 of 37
49. (take_image satellite0 planet42 instrument1 spectrograph2)
   added: (have_image planet42 spectrograph2)
   goals met: 23 of 37
50. (turn_to satellite0 planet7 planet42)
   deleted: (pointing satellite0 planet42)
   added: (pointing satellite0 planet7)
   goals met: 23 of 37
51. (take_image satellite0 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 24 of 37
52. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 24 of 37
53. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 25 of 37
54. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 25 of 37
55. (take_image satellite0 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 26 of 37
56. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 26 of 37
57. (take_image satellite0 star15 instrument1 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 27 of 37
58. (turn_to satellite0 star21 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star21)
   goals met: 27 of 37
59. (take_image satellite0 star21 instrument1 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 28 of 37
60. (turn_to satellite0 star30 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star30)
   goals met: 28 of 37
61. (take_image satellite0 star30 instrument1 spectrograph2)
   added: (have_image star30 spectrograph2)
   goals met: 29 of 37
62. (turn_to satellite0 star33 star30)
   deleted: (pointing satellite0 star30)
   added: (pointing satellite0 star33)
   goals met: 29 of 37
63. (take_image satellite0 star33 instrument1 image1)
   added: (have_image star33 image1)
   goals met: 30 of 37
64. (turn_to satellite0 star36 star33)
   deleted: (pointing satellite0 star33)
   added: (pointing satellite0 star36)
   goals met: 30 of 37
65. (take_image satellite0 star36 instrument1 spectrograph2)
   added: (have_image star36 spectrograph2)
   goals met: 31 of 37
66. (turn_to satellite0 star41 star36)
   deleted: (pointing satellite0 star36)
   added: (pointing satellite0 star41)
   goals met: 31 of 37
67. (take_image satellite0 star41 instrument1 image1)
   added: (have_image star41 image1)
   goals met: 32 of 37
68. (turn_to satellite0 star5 star41)
   deleted: (pointing satellite0 star41)
   added: (pointing satellite0 star5)
   goals met: 32 of 37
69. (take_image satellite0 star5 instrument1 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 33 of 37
70. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 33 of 37
71. (take_image satellite0 star9 instrument1 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 34 of 37
72. (turn_to satellite1 phenomenon35 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon35)
   goals met: 35 of 37
73. (turn_to satellite2 planet42 star21)
   deleted: (pointing satellite2 star21)
   added: (pointing satellite2 planet42)
   goals met: 36 of 37
74. (turn_to satellite3 groundstation2 star41)
   deleted: (pointing satellite3 star41)
   added: (pointing satellite3 groundstation2)
   goals met: 37 of 37
